import React from 'react';
import './App.css';
import Jokes from './Jokes'

function App() {
  return (
    <div className="App">
      <Jokes
        info={{
          number: '1',
          body: 'Любопытный факт: акула нападает только на мокрых людей',
          acter: 'Шон Лок'
        }}
      />
      <Jokes
        info={{
          number: '2',
          body: 'Это вполне нормально, если тридцатилетний мужчина продолжает жить в одном доме со своей мамой. Про это даже фильмы снимают. Например, «Психо».',
          acter: 'Том Аллен'
        }}
      />
      <Jokes
        info={{
          number: '1',
          body: 'В детстве я мечтал, чтобы мой отец был геем. Тогда бы вместо того, чтобы спорить со сверстниками, чей отец сильнее, я бы говорил им: «Зато мой отец может оттрахать твоего!»',
          acter: 'Фрэнки Бойл'
        }}
      />
      <Jokes
        info={{
          number: '1',
          body: 'Моей жене не понравилось, как я подписал диск с записью нашей свадьбы. А ведь я всего лишь написал на нем «Моя первая свадьба».',
          acter: 'Дэйв Томсон'
        }}
      />
    </div>
  );
}

export default App;
